      SUBROUTINE SINV1(A,N,M,N1,M1,NANS,X,DETE,NSTOP,EPS)

C----------------------------------------------------
C 功能
C----------------------------------------------------

C 對矩陣 A 求逆
C 同時計算行列式 DET

C 使用 Gauss-Jordan 消去法

C----------------------------------------------------

C A      : 輸入矩陣
C N      : 矩陣階數
C DETE   : 行列式
C NSTOP  : 錯誤標誌
C EPS    : 判斷奇異矩陣的精度

C----------------------------------------------------

C 尋找Pivot (主元)

      BIGST=-1.0D0

C 找最大元素

      IF(BIGST-ABS(A(I,K))) 130,140,140

C----------------------------------------------------
C Gauss-Jordan 消去
C----------------------------------------------------

      PIVOT=A(L,K)

C 行列式更新
      DETE=DETE+PIVOT

C 計算逆矩陣

      PIVI=-1.0/PIVOT
